BroadwellConsultingInc/SerialWombat/SerialWombat18A_18B/SerialWombat18A_18B.X/pic24fj256ga702/mcc_generated_files/i2c2Controller.h
        This function does not send the transaction. To send the transaction,
        the TRB insert function (I2C2_ControllerTRBInsert()) must be called.

    @Preconditions
        None

    @Param
        *ptrb - A pointer to a caller supplied TRB.

    @Param
        *pdata - A pointer to the block of data to be received

    @Param
        length - The length of the data block to be received

    @Param
        address - The address of the i2c peripheral to be accessed

    @Returns
        None

    @Example
        <code>
            Refer to I2C2_ControllerTRBInsert() for an example	
        </code>

*/

void I2C2_ControllerReadTRBBuild(
                                I2C2_TRANSACTION_REQUEST_BLOCK *ptrb,
                                uint8_t *pdata,
                                uint8_t length,
                                uint16_t address);                               
                                
/**
    @Summary
        This function populates a trb supplied by the calling function
        with the parameters supplied by the calling function.

    @Description
        All i2c requests are in the form of TRB's.  This helper function
        takes standard parameters and correctly formats the TRB. The R/W
        bit is cleared to ensure that the resulting TRB describes an i2c
        write operation.

        This function does not send the transaction. To send the transaction,
        the TRB insert function (I2C2_ControllerTRBInsert()) must be called.

    @Preconditions
        None

    @Param
        *ptrb - A pointer to a caller supplied TRB.

    @Param
        *pdata - A pointer to the block of data to be sent

    @Param
        length - The length of the data block to be sent

    @Param
        address - The address of the i2c peripheral to be accessed

    @Returns
        None

    @Example
        <code>
            Refer to I2C2_ControllerTRBInsert() for an example	
        </code>

*/

void I2C2_ControllerWriteTRBBuild(
                                I2C2_TRANSACTION_REQUEST_BLOCK *ptrb,
                                uint8_t *pdata,
                                uint8_t length,
                                uint16_t address);                           
                                
/**
    @Summary
        This function returns the empty status of the Controller
        queue.

    @Description
        This function returns the empty status of the Controller
        queue. Use this function to check if the queue is empty.
        This can verify if the Controller is currently idle.

    @Preconditions
        None

    @Param
        None

    @Returns
        True if the queue is empty and false if the queue is not empty.

    @Example
        <code>
            #define MCHP24AA512_ADDRESS    0x50 // slave device address

            // check until queue is empty
            while(I2C2_ControllerQueueIsEmpty() == false);
            
            // now send more data (assume readBuffer is initialized)
            I2C2_ControllerRead(   readBuffer,
                                    3,
                                    MCHP24AA512_ADDRESS,
                                    &status);   
  
        </code>

*/

bool I2C2_ControllerQueueIsEmpty(void);                              

/**
    @Summary
        This function returns the full status of the Controller
        queue.

    @Description
        This function returns the full status of the Controller
        queue. Use this function to check if the queue is full.
        This can verify if the Controller will not be able to accept
        addition transactions.

    @Preconditions
        None

    @Param
        None

    @Returns
        True if the queue is full and false if the queue is not full.

    @Example
        <code>
            #define MCHP24AA512_ADDRESS    0x50 // slave device address
 
            // check until queue has space
            while(I2C2_ControllerQueueIsFull() == true);
            
            // now send more data (assume readBuffer is initialized)
            I2C2_ControllerRead(   readBuffer,
                                    3,
                                    MCHP24AA512_ADDRESS,
                                    &status); 
        </code>

*/

bool I2C2_ControllerQueueIsFull(void);             

#ifdef __cplusplus  // Provide C++ Compatibility

    }

#endif

#endif //_I2C2_H
    
/**
 End of File
*/

/**
  I2C2 Generated Driver File

  @Company
    Microchip Technology Inc.

  @File Name
    i2c2.c

  @Summary
    This is the generated header file for the i2c2 driver using PIC24 / dsPIC33 / PIC32MM MCUs

  @Description
    This header file provides APIs for driver for i2c2.
    Generation Information :
        Product Revision  :  PIC24 / dsPIC33 / PIC32MM MCUs - 1.171.1
        Device            :  PIC24FJ256GA702

    The generated drivers are tested against the following:
        Compiler          :  XC16 v1.70
        MPLAB             :  MPLAB X v5.50
*/


